In [1]:
import pandas as pd

In [2]:
data = {"a":[1,2,3,4],
       "b":[4,5,6,7],
       "c":["Adhi" , "sam","jassu","praju"]}

In [3]:
data

{'a': [1, 2, 3, 4], 'b': [4, 5, 6, 7], 'c': ['Adhi', 'sam', 'jassu', 'praju']}

In [4]:
type(data)

dict

In [7]:
df = pd.DataFrame(data)

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df

   a  b      c
0  1  4   Adhi
1  2  5    sam
2  3  6  jassu
3  4  7  praju

In [11]:
df.set_index("c",inplace=True)

In [12]:
df

       a  b
c
Adhi   1  4
sam    2  5
jassu  3  6
praju  4  7

In [18]:
df.reset_index(inplace=True)

In [19]:
df

       c  a  b
0   Adhi  1  4
1    sam  2  5
2  jassu  3  6
3  praju  4  7

In [21]:
data = {
    "a" : [1,2,3,4],
    "b" : [5,4,8,3],
    "c" : [7,2,4,5]
}
df1 = pd.DataFrame(data , index=['a','b','c','d'])

In [22]:
df1

   a  b  c
a  1  5  7
b  2  4  2
c  3  8  4
d  4  3  5

In [23]:
df1.reindex(['b','c','a','d'])

   a  b  c
b  2  4  2
c  3  8  4
a  1  5  7
d  4  3  5

In [24]:
df1.iterrows()

In [25]:
for i in df1.iterrows():  # row wise itteration 
    print(i)

('a', a    1
b    5
c    7
Name: a, dtype: int64)
('b', a    2
b    4
c    2
Name: b, dtype: int64)
('c', a    3
b    8
c    4
Name: c, dtype: int64)
('d', a    4
b    3
c    5
Name: d, dtype: int64)

In [28]:
for i in df1.items():
    print(i)

('a', a    1
b    2
c    3
d    4
Name: a, dtype: int64)
('b', a    5
b    4
c    8
d    3
Name: b, dtype: int64)
('c', a    7
b    2
c    4
d    5
Name: c, dtype: int64)